notifyPlatform/_performance/apipns2.yaml
config: #Results https://artillery.io/docs/getting-started/
  target: 'https:/'
  http:
     timeout: 10  # Responses have to be sent within 10 seconds or the request will be aborted
     pool: 80 # All HTTP requests from all virtual users will be sent over the same 10 connections
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 10    #A warm up phase for 30 seconds. 
      arrivalRate: 20   #20 virtual users/second
    - duration: 30 #A ramp up phase where we go from 20 to 200 new virtual user arrivals over 120 seconds
      arrivalRate: 20 #from 20 virtual users/second
      rampTo: 200 #to 200 virtual users/second
    - duration: 15 #The medium high load for 120 seconds.
      arrivalRate: 500 #500 virtual users/second
    - duration: 30 #The medium high load for 120 seconds.
      arrivalRate: 1000 #500 virtual users/second
  defaults:
    headers:
      Content-Type: 'application/json'
      x-api-key: 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IlBVU0hMT1dFQiIsImNvbnRyYWN0IjoiUFVTSExPV0VCIiwiaWF0IjoyMDE2MjM5MDIyfQ.liOxBh3kFQyjYrIyhg2Uu3COoV83ruUsyLniWEJ8Apw'
scenarios:
  - flow:
      - post:  # PNS by GOOGLE, token: kRt346992-72809WA, PUSHLOWEB contract
          url: "/localhost:30002/pnsSend"
          body: '{	 "contract" : "PUSHLOWEB",	 "application" : "CaixaAPP",	 "user" : "userTst",	 "uuiddevice" : "kRt346992-72809WA",	 "action" : "show",	 "content" : "content push notification" }'  
          headers:
            Content-Type: 'application/json'
            x-api-key: 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IlBVU0hMT1dFQiIsImNvbnRyYWN0IjoiUFVTSExPV0VCIiwiaWF0IjoyMDE2MjM5MDIyfQ.liOxBh3kFQyjYrIyhg2Uu3COoV83ruUsyLniWEJ8Apw'
      - post:  # PNS by APPLE, token: kRt346992-72809WB, PUSHLOWEB contract
          url: "/localhost:30002/pnsSend"
          body: '{	 "contract" : "PUSHLOWEB",	 "application" : "CaixaAPP",	 "user" : "userTst",	 "uuiddevice" : "kRt346992-72809WB",	 "action" : "show",	 "content" : "content push" }' 
          headers:
            Content-Type: 'application/json'
            x-api-key: 'eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiIxMjM0NTY3ODkwIiwibmFtZSI6IlBVU0hMT1dFQiIsImNvbnRyYWN0IjoiUFVTSExPV0VCIiwiaWF0IjoyMDE2MjM5MDIyfQ.liOxBh3kFQyjYrIyhg2Uu3COoV83ruUsyLniWEJ8Apw'